/*		====================
 *		1	2	3	4	5
 *		====================
 *			6	7	8
 *		====================
 *				9
 *		==================== ***나눠서 for문
 *			10	11	12
 *		====================
 *		13	14	15	16	17
 *		====================
 *
 *		줄수 (행) 데이터 (열)
 *		  0		0-4			시작점 : i=j
 *		  1		1-3			끝점: i+j=4 => j=4-i
 *		  2		 2
 *		================
 *		  3		1-3			시작점 :i+j=4 =>j=4-i
 *		  4		0-4			끝점 : i=j
 *
 *		====================
 *		1				13	
 *		====================
 *		2	6		10	14	
 *		====================
 *		3	7	9	11	15	
 *		==================== 
 *		4	8		12	16
 *		====================
 *		5				17
 *		====================
 *
		==> for문에서 행과 열의 중점을 어디에 두느냐!가 중요
			위에 문제에서 j와 i를 바꾸는 것 (출력은 ij순서 그대로)
 * */

public class 메소드3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int[][] arr=new int[5][5];
		int k=1;
		for(int i=0; i<=2;i++)
		{
			for(int j=i;j<=4-i;j++)
			{
				arr[j][i]=k++;
			}
		}
		for(int i=3;i<=4;i++)
		{
			for(int j=4-i;j<=i;j++)
			{
				arr[j][i]=k++;
			}
		}
		//출력
		for(int i=0;i<5;i++)
		{
			for(int j=0;j<5;j++)
			{
				if(arr[i][j]==0)
					System.out.print("\t");
				else
					System.out.print(arr[i][j]+"\t");
			}
			//줄간격
			System.out.println();
		}
	}

}
